2021-04-04-magit.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/faq/rss.xml"
      title="RSS feed for https://martiyo.github.io/faq/"
    />
    <title>It's Magit!</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/faq">/home</a></li>
          <li><a href="https://martiyo.github.io/faq/about">/about</a></li>
          <li><a href="https://martiyo.github.io/faq/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">04 abr 2021</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/faq/2021-04-04-magit.html"
          >It's Magit!</a
        >
      </h1>

      <div id="outline-container-org4b64df5" class="outline-2">
        <h2 id="org4b64df5">¿Que es magit?</h2>
        <div class="outline-text-2" id="text-org4b64df5">
          <p>
            Magit es una interfaz de usuario completa basada en texto para Git .
            Llena la brecha evidente entre la interfaz de línea de comandos de
            Git y varias GUI, lo que le permite realizar tareas de control de
            versiones triviales y elaboradas con solo un par de pulsaciones de
            teclas mnemotécnicas. Magit parece una versión mejorada de lo que
            obtiene después de ejecutar algunos comandos de Git, pero en Magit
            cada bit de información visible también es procesable hasta un punto
            que va mucho más allá de lo que proporciona cualquier GUI de Git y
            se encarga de actualizar automáticamente esta salida cuando se
            vuelve obsoleto. En segundo plano, Magit solo ejecuta comandos de
            Git y, si lo desea, puede ver qué se está ejecutando exactamente, lo
            que le permite aprender la gitlínea de comandos usando Magit.
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/faq/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/faq/tag-git.html">git</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/faq/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
